# ShowGrandTotalTitle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ShowGrandTotalTitle Property
ScheduleDefinition Class See Also
---
Indicates if the grand total row should display a title.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowGrandTotalTitle { get; set; }
```

Visual Basic
---
```text
Public Property ShowGrandTotalTitle As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGrandTotalTitle {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if a title should be displayed, false otherwise.
# Remarks
The title consists of the text "Grand total".
ShowGrandTotalTitle can only be enabled if ShowGrandTotal is enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Display of a grand total row is not enabled. |

# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace